IO tools (text, CSV, HDF5, â€¦)
The pandas I/O API is a set of top level reader functions accessed like pandas.read_csv() that generally return a pandas object. The corresponding writer functions are object methods that are accessed like DataFrame.to_csv(). Below is a table containing available readers and writers.

Format Type	Data Description	Reader	Writer
Text	CSV	read_csv	to_csv
Text	Fixed-Width Text File	read_fwf	NA
Text	JSON	read_json	to_json
Text	HTML	read_html	to_html
Text	LaTeX	Styler.to_latex	NA
Text	XML	read_xml	to_xml
Text	Local Clipboard	read_clipboard	to_clipboard
Binary	MS Excel	read_excel	to_excel
Binary	OpenDocument	read_excel	NA
Binary	HDF5 Format	read_hdf	to_hdf
Binary	Feather Format	read_feather	to_feather
Binary	Parquet Format	read_parquet	to_parquet
Binary	ORC Format	read_orc	to_orc
Binary	Stata	read_stata	to_stata
Binary	SAS	read_sas	NA
Binary	SPSS	read_spss	NA
Binary	Python Pickle Format	read_pickle	to_pickle
SQL	SQL	read_sql	to_sql

skip_blank_linesboolean, default True
If True, skip over blank lines rather than interpreting as NaN values.

In [1]:
import pandas as pd

from io import StringIO

data = "col1,col2,col3\na,b,1\na,b,2\nc,d,3"

pd.read_csv(StringIO(data))

  col1 col2  col3
0    a    b     1
1    a    b     2
2    c    d     3

In [2]:
#Returning a subset 
pd.read_csv(StringIO(data), usecols=lambda x: x.upper() in ["COL1", "COL3"])

  col1  col3
0    a     1
1    a     2
2    c     3

In [3]:
data = "col1,col2,col3\na,b,1\na,b,2\nc,d,3"

pd.read_csv(StringIO(data))

  col1 col2  col3
0    a    b     1
1    a    b     2
2    c    d     3

In [4]:
#skip_blank_linesboolean, default True. If True, skip over blank lines rather than interpreting as NaN values.
pd.read_csv(StringIO(data), skiprows=lambda x: x % 2 != 0)

  col1 col2  col3
0    a    b     2

In [5]:
#Specifying column data types. You can indicate the data type for the whole DataFrame or individual columns:
import numpy as np

data = "a,b,c,d\n1,2,3,4\n5,6,7,8\n9,10,11"

print(data)

a,b,c,d
1,2,3,4
5,6,7,8
9,10,11

In [6]:
df = pd.read_csv(StringIO(data), dtype=object)
df

   a   b   c    d
0  1   2   3    4
1  5   6   7    8
2  9  10  11  NaN

In [7]:
df = pd.read_csv(StringIO(data), dtype={"b": object, "c": np.float64, "d": "Int64"})
df.dtypes

a      int64
b     object
c    float64
d      Int64
dtype: object

In [8]:
data = "col_1\n1\n2\n'A'\n4.22"
df = pd.read_csv(StringIO(data), converters={"col_1": str})
df["col_1"].apply(type).value_counts()

col_1
<class 'str'>    4
Name: count, dtype: int64

Specifying categorical dtype
Categorical columns can be parsed directly by specifying dtype='category' or dtype=CategoricalDtype(categories, ordered).

In [9]:
data = "col1,col2,col3\na,b,1\na,b,2\nc,d,3"
pd.read_csv(StringIO(data))

  col1 col2  col3
0    a    b     1
1    a    b     2
2    c    d     3

In [10]:
pd.read_csv(StringIO(data)).dtypes

col1    object
col2    object
col3     int64
dtype: object

In [11]:
pd.read_csv(StringIO(data), dtype="category").dtypes

col1    category
col2    category
col3    category
dtype: object

In [12]:
#Individual columns can be parsed as a Categorical using a dict specification:
pd.read_csv(StringIO(data), dtype={"col1": "category"}).dtypes

col1    category
col2      object
col3       int64
dtype: object

In [13]:
#Naming and using columns
#A file may or may not have a header row. pandas assumes the first row should be used as the column names:
data = "a,b,c\n1,2,3\n4,5,6\n7,8,9"

print(data)

a,b,c
1,2,3
4,5,6
7,8,9

In [14]:
pd.read_csv(StringIO(data))

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [15]:
pd.read_csv(StringIO(data), names=["foo", "bar", "baz"], header=0)

   foo  bar  baz
0    1    2    3
1    4    5    6
2    7    8    9

In [16]:
pd.read_csv(StringIO(data), names=["foo", "bar", "baz"], header=None)

  foo bar baz
0   a   b   c
1   1   2   3
2   4   5   6
3   7   8   9

In [17]:
#Filtering columns (usecols)
data = "a,b,c,d\n1,2,3,foo\n4,5,6,bar\n7,8,9,baz"
pd.read_csv(StringIO(data))

   a  b  c    d
0  1  2  3  foo
1  4  5  6  bar
2  7  8  9  baz

In [18]:
pd.read_csv(StringIO(data), usecols=["b", "d"])

   b    d
0  2  foo
1  5  bar
2  8  baz

In [19]:
pd.read_csv(StringIO(data), usecols=[0, 2, 3])

   a  c    d
0  1  3  foo
1  4  6  bar
2  7  9  baz

In [20]:
'''
Dealing with Unicode data
The encoding argument should be used for encoded unicode data, which will result in byte strings being decoded to unicode in the result
'''
from io import BytesIO
data = b"word,length\n" b"Tr\xc3\xa4umen,7\n" b"Gr\xc3\xbc\xc3\x9fe,5"
data = data.decode("utf8").encode("latin-1")
df = pd.read_csv(BytesIO(data), encoding="latin-1")
df

      word  length
0  TrÃ¤umen       7
1    GrÃ¼ÃŸe       5

In [21]:
df["word"][1]

'GrÃ¼ÃŸe'

Infinity
inf like values will be parsed as np.inf (positive infinity), and -inf as -np.inf (negative infinity). These will ignore the case of the value, meaning Inf, will also be parsed as np.inf.

In [22]:
#Booleans handling
data = "a,b,c\n1,Yes,2\n3,No,4"
pd.read_csv(StringIO(data))

   a    b  c
0  1  Yes  2
1  3   No  4

In [23]:
pd.read_csv(StringIO(data), true_values=["Yes"], false_values=["No"])

   a      b  c
0  1   True  2
1  3  False  4

In [24]:
#Handling bad lines
data = "a,b,c\n1,2,3\n4,5,6,7\n8,9,10"
pd.read_csv(StringIO(data), on_bad_lines="skip")

   a  b   c
0  1  2   3
1  8  9  10

In [25]:
#Quoting and escpe characters
data = 'a,b\n"hello, \\"Bob\\", nice to see you",5'
print(data)

a,b
"hello, \"Bob\", nice to see you",5

In [26]:
pd.read_csv(StringIO(data), escapechar="\\")

                               a  b
0  hello, "Bob", nice to see you  5

In [27]:
# Column specifications are a list of half-intervals
colspecs = [(0, 6), (8, 20), (21, 33), (34, 43)]

df = pd.read_fwf(r"C:\Users\Lenovo\Downloads\Compressed\archive\resume_data.csv", colspecs=colspecs, header=None, index_col=0)

df

                   1             2          3
0
addres  career_objec  ive,skills,e  ucational
,Big d   a analytics  orking and d  tabase wa
Troubl       hooting           NaN        NaN
Collab         ation           NaN        NaN
Docume         ation           NaN        NaN
...              ...           ...        ...
Compli            ce           NaN        NaN
Site V  its","AutoCA           NaN        NaN
ETABS            NaN           NaN        NaN
Micros  t Office Sui             e        NaN
MS Pro      ct",0.65           NaN        NaN

[212009 rows x 3 columns]

#You can pass in a URL to read or write remote files to many of pandasâ€™ IO functions - the following example shows reading a CSV file:
df = pd.read_csv("https://download.bls.gov/pub/time.series/cu/cu.item", sep="\t")

JSON
Read and write JSON format files and strings.

In [28]:
dfj = pd.DataFrame(np.random.randn(5, 2), columns=list("AB"))
json = dfj.to_json()
json

'{"A":{"0":-1.9586552171,"1":0.7443213676,"2":-0.4651095768,"3":1.3434395053,"4":-0.8388768459},"B":{"0":-0.2707303044,"1":0.8893912758,"2":-1.8628142681,"3":1.1052281274,"4":-2.2368479255}}'

In [29]:
#Date handling
dfd = pd.DataFrame(np.random.randn(5, 2), columns=list("AB"))

dfd["date"] = pd.Timestamp("20130101")

dfd = dfd.sort_index(axis=1, ascending=False)

json = dfd.to_json(date_format="iso")

json

'{"date":{"0":"2013-01-01T00:00:00.000","1":"2013-01-01T00:00:00.000","2":"2013-01-01T00:00:00.000","3":"2013-01-01T00:00:00.000","4":"2013-01-01T00:00:00.000"},"B":{"0":-1.085840284,"1":-1.3162201879,"2":0.4542177429,"3":-0.5945243135,"4":-0.2239312953},"A":{"0":-0.3215006975,"1":0.7400082848,"2":0.082052654,"3":0.8172866594,"4":0.3380185391}}'

In [30]:
dfj2 = dfj.copy()

dfj2["date"] = pd.Timestamp("20130101")

dfj2["ints"] = list(range(5))

dfj2["bools"] = True

dfj2.index = pd.date_range("20130101", periods=5)

dfj2.to_json("test.json")

with open("test.json") as fh:
    print(fh.read())

{"A":{"1356998400000":-1.9586552171,"1357084800000":0.7443213676,"1357171200000":-0.4651095768,"1357257600000":1.3434395053,"1357344000000":-0.8388768459},"B":{"1356998400000":-0.2707303044,"1357084800000":0.8893912758,"1357171200000":-1.8628142681,"1357257600000":1.1052281274,"1357344000000":-2.2368479255},"date":{"1356998400000":1356,"1357084800000":1356,"1357171200000":1356,"1357257600000":1356,"1357344000000":1356},"ints":{"1356998400000":0,"1357084800000":1,"1357171200000":2,"1357257600000":3,"1357344000000":4},"bools":{"1356998400000":true,"1357084800000":true,"1357171200000":true,"1357257600000":true,"1357344000000":true}}

In [31]:
from io import StringIO
pd.read_json(StringIO(json))

        date         B         A
0 2013-01-01 -1.085840 -0.321501
1 2013-01-01 -1.316220  0.740008
2 2013-01-01  0.454218  0.082053
3 2013-01-01 -0.594524  0.817287
4 2013-01-01 -0.223931  0.338019

In [32]:
pd.read_json("test.json")

                   A         B  date  ints  bools
2013-01-01 -1.958655 -0.270730  1356     0   True
2013-01-02  0.744321  0.889391  1356     1   True
2013-01-03 -0.465110 -1.862814  1356     2   True
2013-01-04  1.343440  1.105228  1356     3   True
2013-01-05 -0.838877 -2.236848  1356     4   True

pandas provides a utility function to take a dict or list of dicts and normalize this semi-structured data into a flat table.

In [33]:
data = [
    {
        "state": "Florida",
        "shortname": "FL",
        "info": {"governor": "Rick Scott"},
        "county": [
            {"name": "Dade", "population": 12345},
            {"name": "Broward", "population": 40000},
            {"name": "Palm Beach", "population": 60000},
        ],
    },
    {
        "state": "Ohio",
        "shortname": "OH",
        "info": {"governor": "John Kasich"},
        "county": [
            {"name": "Summit", "population": 1234},
            {"name": "Cuyahoga", "population": 1337},
        ],
    },
]


pd.json_normalize(data, "county", ["state", "shortname", ["info", "governor"]])

         name  population    state shortname info.governor
0        Dade       12345  Florida        FL    Rick Scott
1     Broward       40000  Florida        FL    Rick Scott
2  Palm Beach       60000  Florida        FL    Rick Scott
3      Summit        1234     Ohio        OH   John Kasich
4    Cuyahoga        1337     Ohio        OH   John Kasich

In [43]:
#Reading html
url = "https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list"
pd.read_html(url)

[                               Bank Name               City         State  \
 0                   Pulaski Savings Bank            Chicago      Illinois
 1     The First National Bank of Lindsay            Lindsay      Oklahoma
 2  Republic First Bank dba Republic Bank       Philadelphia  Pennsylvania
 3                          Citizens Bank           Sac City          Iowa
 4               Heartland Tri-State Bank            Elkhart        Kansas
 5                    First Republic Bank      San Francisco    California
 6                         Signature Bank           New York      New York
 7                    Silicon Valley Bank        Santa Clara    California
 8                      Almena State Bank             Almena        Kansas
 9             First City Bank of Florida  Fort Walton Beach       Florida

     Cert                 Aquiring Institution      Closing Date  \
 0  28611                      Millennium Bank  January 17, 2025
 1   4134   First Bank & Trust Co., Duncan, OK  October 18, 2024
 2  27332    Fulton Bank, National Association    April 26, 2024
 3   8758            Iowa Trust & Savings Bank  November 3, 2023
 4  25851               Dream First Bank, N.A.     July 28, 2023
 5  59017            JPMorgan Chase Bank, N.A.       May 1, 2023
 6  57053                  Flagstar Bank, N.A.    March 12, 2023
 7  24735  First Citizens Bank & Trust Company    March 10, 2023
 8  15426                          Equity Bank  October 23, 2020
 9  16748            United Fidelity Bank, fsb  October 16, 2020

    Fund  Sort ascending
 0                 10548
 1                 10547
 2                 10546
 3                 10545
 4                 10544
 5                 10543
 6                 10540
 7                 10539
 8                 10538
 9                 10537  ]

In [44]:
#Writing to html files
from IPython.display import display, HTML

df = pd.DataFrame(np.random.randn(2, 2))

df

          0         1
0  0.301808  0.416014
1  0.406586 -1.756922

In [45]:
html = df.to_html()
print(html)

<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>0</th>
      <th>1</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>0.301808</td>
      <td>0.416014</td>
    </tr>
    <tr>
      <th>1</th>
      <td>0.406586</td>
      <td>-1.756922</td>
    </tr>
  </tbody>
</table>

LaTeX
Currently there are no methods to read from LaTeX, only output methods.